# 開発するには

以下を上から順に実行する。

## VPCの作成

VPC > VPCを開き、「VPCの作成」をクリックし、VPCの設定を行う。

* 名前 : 任意の名前
* IPv4 CIDRブロック : 10.0.0.0/16

## パブリックサブネットの作成

VPC > サブネットを開き、「サブネット」をクリックし、パブリックサブネットの設定を行う。

* VPC ID : 任意のID
* サブネット名 : 任意の名前
* アベイラビリティーゾーン : ap-northeast-1a
* IPv4 CIDRブロック : 10.0.0.0/24

## インターネットゲートウェイの作成

1. VPC > インターネットゲートウェイを開き、「インターネットゲートウェイを作成」をクリックし、インターネットゲートウェイの設定を行う。

* 名前タグ : 任意の名前

2. 作成済みのインターネットゲートウェイを右クリックし、「VPCにアタッチ」を選択し、インターネットゲートウェイをVPCにアタッチする。

* 使用可能なVPC : 作成したVPC

## ルートテーブルの作成

1. VPC > ルートテーブルを開き、「ルートテーブルを作成」をクリックし、ルートテーブルを作成する。

* 名前タグ : 任意の名前
* VPC : 作成したVPC

2. 作成したルートテーブルをルートテーブルの⼀覧から選び、画⾯下部の「ルート」タブを選択。「ルートの編集」「ルートの追加」と順にクリックし、ルートテーブルをインターネットゲートウェイと紐付ける。

* 送信先 : 0.0.0.0/0
* ターゲット : 作成したインターネットゲートウェイ

## サブネットとルートテーブルの関連付け

VPC > サブネットを開き、作成したサブネットを選択。画⾯下部の「ルートテーブル」タブを選択し、「ルートテーブルの関連付けの編集」をクリックし、サブネットとルートテーブルの関連付けを行う。

* ルートテーブルID : 作成したルートテーブルのID

## パブリックIPアドレスの⾃動割り当てを設定する

VPC > サブネットを開き、作成したパブリックサブネットを右クリック。「⾃動割り当てIP設定の変更」をクリック後、IPv4の⾃動割り当てにチェックを⼊れる。

## セキュリティグループを作成する

VPC > セキュリティグループを開き、「セキュリティグループを作成」をクリックし、セキュリティーグループを作成する。

* セキュリティグループ名 : 任意の名前
* VPC : 作成済したVPC
* インバウンドルールのタイプ : http、https、ssh
* ソース : Anywhere IPv4

## ECRを作成する

ECR > リポジトリを開き、「リポジトリを作成」をクリックし、Rails API、Nginx、Unicornのリポジトリを作成する。

* 可視性設定 : パブリック
* リポジトリ名 : 任意の名前

## EC2 on ECSを作成する

1. タスク定義を作成する

2. ECS > クラスターを開き、「クラスターの作成」をクリックし、クラスターを作成する。クラスターテンプレートの選択で「EC2 Linux + ネットワーキング」を選び、クラスターの設定を行う。

* クラスター名 : 任意の名前
* インスタンスタイプ : 任意
* インスタンス数 : 任意 
* キーペア : 任意
* VPC : 作成したVPC
* サブネット : 作成したサブネット
* コンテナインスタンスのIAMロール : 新しいロールの作成

3. ECS > クラスターを開き、作成したクラスターを選択。「サービス」タブを選び、「作成」をクリックし、サービスを作成する。

* 起動タイプ : EC2  
* タスク定義 : 作成したタスク定義
* クラスター : 作成したクラスター
* サービス名 : 任意の名前
* タスクの数 : 1
